Revit 2027 API
BuiltInFailures.RoofFailures.RoofExceedsMaxHeight Property
 Roof exceeds user-specified maximum height
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RoofExceedsMaxHeight { get; }
Public Shared ReadOnly Property RoofExceedsMaxHeight As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RoofExceedsMaxHeight {
	FailureDefinitionId^ get ();
}
static member RoofExceedsMaxHeight : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RoofFailures Class
Autodesk.Revit.DB Namespace